hotRoom6H_yPlus/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 9.38e-4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 9.38e-4;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            kqRWallFunction;
        value           uniform 9.38e-4;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 9.38e-4;
    }
    side01
    {
        type            symmetry;
    }

    side02
    {
        type            symmetry;
    }
}


// ************************************************************************* //
