hotRoom6H_yPlus/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1400;
        startFace       204100;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1400;
        startFace       205500;
    }
    inlet
    {
        type            patch;
        nFaces          1000;
        startFace       206900;
    }
    outlet
    {
        type            patch;
        nFaces          1000;
        startFace       207900;
    }
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3500;
        startFace       208900;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          3500;
        startFace       212400;
    }
)

// ************************************************************************* //
